= Command Line Interface for Anypoint Platform
:keywords: administration, api, organization, users, gateway, theme, cli

image:logo-cloud-active.png[link="/runtime-manager/deployment-strategies", title="CloudHub"]
image:logo-hybrid-active.png[link="/runtime-manager/deployment-strategies", title="Hybrid Deployment"]
image:logo-server-disabled.png[link="/runtime-manager/deployment-strategies", title="Anypoint Platform On-Premises"]
image:logo-pcf-disabled.png[link="/runtime-manager/deployment-strategies", title="Pivotal Cloud Foundry"]

Anypoint Platform provides you a command line tool to interact with your Cloudhub applications, link:/runtime-manager/virtual-private-cloud[VPCs] and link:/runtime-manager/cloudhub-dedicated-load-balancer[Cloudhub load balancers] through both interactive shell and standard CLI modes.

== Assumptions

This document assumes that you are familiar with our link:/api-manager/tutorials[API Manager Tutorials] and that you are able to link:/api-manager/managing-your-api[manage your API using Anypoint Platform].

== Installation

[IMPORTANT]
First you need to make sure you have the node.js runtime environment installed in your machine. Along with it, you'll need to use node's default package manager (npm) to be able to install Anypoint-CLI.
Following the steps in the link:https://docs.npmjs.com/getting-started/installing-node[node documentation] will help you get both resources.

You can install Anypoint-CLI using node's default package manager by typing in your console

[source,Example]
----
$ npm install -g anypoint-cli
----

If you already have Anypoint CLI running on your machine, you can get the latest version by running

[source,Example]
----
$ npm update -g anypoint-cli
----

[NOTE]
Depending on the configuration of your system, you might have to run these commands using administrator`s credentials.

[NOTE]
====
If you're using the Anypoint Platform On-premises Edition to host the entire platform on-premises, make sure that you first set the 'host' field on the `~/.anypoint/credentials` file to the address where you're locally hosting the platform. By doing that, this CLI will be addressing your local installation rather than the online platform.

You can also achieve the same by adding a `host` parameter to the command that starts up the CLI
----
anypoint-cli --host myhost.company.com
----

====

== Usage

Every instance of Anypoint-CLI takes any of the following parameters:

[%header,cols="15,75a,10a"]
|===
|Parameter |Description| Required
|username | Your Anypoint Platform username. +
You can also use an environment variable (e.g. `export ANYPOINT_USERNAME=<name>`)| *Yes*
|password | Your Anypoint Platform password. +
You can also use an environment variable (e.g. `export ANYPOINT_PASSWORD=<pwd>`)| *Yes*
|organization| Your organization within Anypoint Platform. +
You can also use an environment variable (e.g. `export ANYPOINT_ORG=<name>`)| No
|environment| Your Anypoint-CLI environment. +
You can also use an environment variable (e.g. `export ANYPOINT_ENV=<name>`)| No
|===

=== Logging In

As instructed above, the username and password parameters are required. However, if you choose to simply pass your username, Anypoint Platform CLI prompts for your password.

[source,Example,linenums]
----
> anypoint-cli --username="user"
Password: ****
----

If you choose to pass the credentials when running Anypoint-CLI, we strongly recommend passing both parameters as environment variables: +
`$ANYPOINT_USERNAME` and `$ANYPOINT_PASSWORD`.

[source,Example,linenums]
----
> export anypoint_username="username"
> export anypoint_password="password"
> anypoint-cli --username=$anypoint_username --password=$anypoint_password
----

The recommended way of passing your credentials is using the `credentials` file located in the `~/.anypoint/` directory in Linux and OSx or `C:\Users\USERNAME \.anypoint\` in Windows. +

[NOTE]
The `/.anypoint/` directory is not automatically created during installation, so you need to create it in the user's directory of your corresponding system.

Set up a blank file named `credentials` with the following structure:

[source,credentials,linenums]
----
{
 "default": {
  "username": "yourAnypointUserName",
  "password": "yourAnypointPassword"
 },
 "otherProfile": {
  "username": "",
  "password": "",
  "organization": "",
  "environment": "",
  "host": ""
 }
}
----

Then run the anypoint-cli command without any parameter:

[source,Example,linenums]
----
> anypoint-cli
----

Environment variables override credentials file parameters and Command line parameters override environment variables. +
If you don't pass a command line parameter, the default profile properties are used.


[IMPORTANT]
--
A few considerations to keep in mind while using Anypoint-CLI:

. If you don't set an environment, you will be automatically sent to `production`. +
. Your Anypoint session won't expire if you are accessing through this command line interface. +
. Anypoint-CLI works with autocomplete. You can start typing the name of the command or parameter and hit `tab` for an autocomplete, or double tap `tab` for a list of all possible options.
--

Once you have your parameters in order, you can pass commands.

== List of Commands

[TIP]
Use the `--help` option with a command to see what options are available.
A list of available commands is below:

[%header,cols="35a,65a"]
|===
|Command |Description
// Account commands
|<<account user describe>>| Show account details
|<<account business-group list>>| Lists business groups
|<<account business-group describe>>| Show details of a business group
|<<account environment list>>| Lists environments
|<<account environment create>>| Create new environment
|<<account environment delete>>| Delete an environment

// Rntime Mgr commands
|<<runtime-mgr alert list>>| Lists all alerts in the environment
|<<runtime-mgr alert-history describe>>| Describes the history of the alarm
|<<runtime-mgr application list>>| Lists all applications in the environment
|<<runtime-mgr application describe>>| Show application details
|<<runtime-mgr application describe-json>>| Show raw application JSON response
|<<runtime-mgr application stop>>| Stop a running application
|<<runtime-mgr application start>>| Start an application
|<<runtime-mgr application restart>>| Restart a running application
|<<runtime-mgr application delete>>| Delete an application
|<<runtime-mgr application deploy>>| Deploy a new application
|<<runtime-mgr application modify>>| Modify an existing application, optionally updating the zip file
|<<runtime-mgr application revert-runtime>>| Reverts application to its previous runtime
|<<runtime-mgr application download-logs>>| Download application logs to specified directory
|<<runtime-mgr application tail-logs>>| Tail application logs

// CloudHub Load balancer commands
|<<cloudhub load-balancer list>>| Lists all Load balancers in an organization
|<<cloudhub load-balancer describe>>| Show LB details
|<<cloudhub load-balancer describe-json>>| Show raw LB JSON response
|<<cloudhub load-balancer create>>| Create a Load balancer
|<<cloudhub load-balancer start>>| Starts a Load balancer
|<<cloudhub load-balancer stop>>| Stops a Load balancer
|<<cloudhub load-balancer delete>>| Delete a Load balancer
|<<cloudhub load-balancer ssl-endpoint add>>| Add an additional certificate to an existing Load balancer
|<<cloudhub load-balancer ssl-endpoint remove>>| Remove a certificate from a Load balancer
|<<cloudhub load-balancer ssl-endpoint set-default>>| Set the default certificate that the Load balancer will serve
|<<cloudhub load-balancer ssl-endpoint describe>>| Show the Load balancer configuration for a particular certificate
|<<cloudhub load-balancer whitelist add>>| Add an IP or range of IPs to the Load balancer whitelist
|<<cloudhub load-balancer whitelist remove>>| Remove an IP or range of IPs from the Load balancer whitelist
|<<cloudhub load-balancer mappings describe>>| Lists the proxy mapping rules for a Load balancer. If no certificateName is given, the mappings for the default SSL endpoint are shown
|<<cloudhub load-balancer mappings add>>| Add a proxy mapping rule at the specified indexIf no certificateName is given, the mappings for the default SSL endpoint are shown
|<<cloudhub load-balancer mappings remove>>| Remove a proxy mapping ruleIf no certificateName is given, the mappings for the default SSL endpoint are shown
|<<cloudhub region list>>| Lists all supported regions
|<<cloudhub runtime list>>| Lists all available runtimes

// Cloudhub VPC commands
|<<cloudhub vpc list>>| Lists all VPCs
|<<cloudhub vpc describe>>| Show VPC details
|<<cloudhub vpc describe-json>>| Show raw VPC JSON response
|<<cloudhub vpc create>>| Create a new VPC
|<<cloudhub vpc delete>>| Delete an existing VPC
|<<cloudhub vpc environments add>>| Modifies the VPC association to Runtime Manager environments.
|<<cloudhub vpc environments remove>>| Modifies the VPC association to Runtime Manager environments.
|<<cloudhub vpc business-groups add>>| Share a VPC with a list of Business Groups.
|<<cloudhub vpc business-groups remove>>| Share a VPC with a list of Business Groups.
|<<cloudhub vpc dns-servers set>>| Sets the domain names that are resolved using your internal DNS servers. If used with no option, internal DNS will be disabled
|<<cloudhub vpc dns-servers unset>>| Clears the list domain names that are resolved using your internal DNS servers
|<<cloudhub vpc firewall-rules describe>>| Show firewall rule for Mule applications in this VPC
|<<cloudhub vpc firewall-rules add>>| Add a firewall rule for Mule applications in this VPC
|<<cloudhub vpc firewall-rules remove>>| Remove a firewall rule for Mule applications in this VPC

// Use commands
|<<use environment>>| Make specified environment active
|<<use business-group>>| Make specified business-group active
|===

An Anypoint-CLI call should then have the following form:
[source,Example]
----
$ anypoint-cli [params] [command]
----

If you choose not to pass a command, Anypoint-CLI will run in *interactive mode*.
If you choose to pass a specific command and there is an error, the application will exit and return you a description of the issue.

=== account user describe

[source,Example]
----
> account user describe  [options]
----

This command simply returns the information for your account. This includes your username, your full name, your email address, and creation of your account. +
This command does not take any options, except for the default `--help`

=== account business-group list

[source,Example]
----
> account business-group list [options]
----

This command displays all link:/access-management/organization#business-groups[business groups]. It returns return the name of the business group, the type ('Master' or 'Business unit') and the Id. +
This command does not take any options, except for the default `--help`.


=== account business-group describe

[source,Example]
----
> account business-group describe  [options] <name>
----

This command displays information on the business group you pass in <name>.

[NOTE]
--
If your business group or organization name contains spaces, you need to enclose its name between `"` characters.

----
> account business-group describe "QA Organization"
----
--

It returns data such as the owner, the type, subscription information, the entitlements of the group and in which environment is running.
This command does not take any options, except for the default `--help`.

=== account environment list

[source,Example]
----
> account environment list [options]
----
This command lists all your Environments in your Anypoint Platform. It will return your environment name, its Id and whether it's sandboxed or not. +
This command does not take any options, except for the default `--help`.

=== account environment create

[source,Example]
----
> account environment create [options] <name>
----
This command creates a new environment using the name you set in <name>. +
You can use the `--sandbox` option to create this environment as a sandbox, or use the default `--help`.

=== account environment delete

[source,Example]
----
> account environment delete  [options] <name>
----
This command deletes the environment specified in <name> +

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default `--help`.

=== runtime-mgr alert list

[source,Example]
----
> runtime-mgr alert list [options]
----
This command lists all alerts associated to your current environment

This command does not take any options, except for the default `--help`.

=== runtime-mgr alert-history describe

[source,Example]
----
> runtime-mgr alert-history describe [options] <name>
----
This command describes the history of the alarm passed in <name>.

This command does not take any options, except for the default `--help`.

=== runtime-mgr application list

[source,Example]
----
> runtime-mgr application list [options]
----

This command lists all applications available in your Anypoint-CLI. It returns your application name, its status, the amount of vCores assigned and the last time it was updated. +
This command does not take any options, except for the default `--help`.

=== runtime-mgr application describe

[source,Example]
----
> runtime-mgr application describe [options] <name>
----

This command displays information on the application you pass in <name>. +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
It will return data such as the application's domain, its status, last time it was updated, the Runtime version, the .zip file name, the region, monitoring and Workers; as well as 'TRUE' or 'FALSE' information for persistent queues and static IPs enablement. +
This command does not take any options, except for the default `--help`.

=== runtime-mgr application describe-json

[source,Example]
----
> runtime-mgr application describe-json  [options] <name>
----

This command returns the raw JSON response of the application you specify in <name>. +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== runtime-mgr application stop

[source,Example]
----
> runtime-mgr application stop  [options] <name>
----

This command stops the running application you specify in <name> +
You can start typing your application's name and hit `tab` for Anypoint-ClI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== runtime-mgr application start

[source,Example]
----
> runtime-mgr application start [options] <name>
----

This command starts the running application you specify in <name> +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== runtime-mgr application restart

[source,Example]
----
> runtime-mgr application restart  [options] <name>
----

This command restarts the running application you specify in <name> +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== runtime-mgr application delete

[source,Example]
----
> runtime-mgr application delete [options] <name>
----

This command deletes the running application you specify in <name>

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default `--help`.

=== runtime-mgr application deploy

[source,Example]
----
> runtime-mgr application deploy  [options] <name> <zipfile>
----

This command deploys the Mule deployable archive .zip file that you specify in <zipfile> using the name you set in <name>. +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
You will have to provide the absolute or relative path to the deployable zip file in your local hard drive and the name you give to your application has to be unique.

The options this command can take are:
[%header,cols="30a,70a"]
|===
|Option |Description
|--runtime                                   | Name of the runtime environment
|--workers                                      | Number of workers. (This value is '1' by default)
|--workerSize                               | Size of the workers in vCores. (This value is '1' by default)
|--region                                        | Name of the region to deploy to. +
For a list of all supported regions, use the <<cloudhub region list>> command.
|--property                                    | Set a property (name:value). Can be specified multiple times. +
The property to be set must be passed enclosed in quotes and characters `:` and `=` must be escaped. +
(e.g. `--property "salesforce.password:qa\=34534"`).

Character `:` is not supported for the property's name.
|--propertiesFile                        | Overwrite all properties with values from this file. The file format is 1 or more lines in name:value format. Set the absolute path of the properties file in your local hard drive.
|--persistentQueues                   | Enable or disable persistent queues. Can take 'true' or 'false' values. (This value is 'false' by default)
|--persistentQueuesEncrypted  | Enable or disable persistent queue encryption. Can take 'true' or 'false' values. (This value is 'false' by default)
|--staticIPsEnabled                                      | Enable or disable static IPs. Can take 'Enable' or 'Disabled' values. (This value is 'Disabled' by default)
|--autoRestart                            | Automatically restart app when not responding. Can take 'true' or 'false' values. (This value is 'false' by default)
|--help                                                  | output usage information
|===
Note that from Anypoint-CLI you won't be able to allocate static IPs. You can simply enable and disable them.

After typing any option, you can double tap the `tab` key for a full list of all possible options.
For example:
[source,Example]
----
> deploy <app name> --runtime [tab][tab]
----
Lists all possible runtimes you can select.

[IMPORTANT]
====
If you deploy without using any options, your application will deploy using all your default values.
====

=== runtime-mgr application modify

[source,Example]
----
> runtime-mgr application modify  [options] <name> [zipfile]
----
This command updates the settings of an existing application. Optionally you can update it by uploading a new .zip file. +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass.
This command can take all the same options as the *deploy* option.

You can also start typing your option and hit `tab` for Autocomplete-CLI to autocomplete it for you.

=== runtime-mgr application revert-runtime

[source,Example]
----
> runtime-mgr application revert-runtime [options] <name>
----
This command reverts the application defined in <name> to its previous runtime environment. +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== runtime-mgr application download-logs

[source,Example]
----
> runtime-mgr application download-logs [options] <name> <directory>
----
This command downloads logs the for application specified in <name> to the specified directory. +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
Keep in mind that contrarily to what you see in the UI, the logs you download from the CLI won't separate system logs from worker logs.

=== runtime-mgr application tail-logs

[source,Example]
----
> runtime-mgr application tail-logs [options] <name>
----

This command tails application logs. +
You can start typing your application's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== cloudhub load-balancer list

[source,Example]
----
> cloudhub cloudhub load-balancer list [options]
----
This command lists all load balancers in your Anypoint Platform. It displays load balancer's name, domain, its state and the VPC Id to which the load balancer is bound. +
This command does not take any options, except for the default `--help`.

=== cloudhub load-balancer describe

[source,Example]
----
> cloudhub load-balancer describe [options] <name>
----
This command displays information about the load balancer that is specified in <name>. +
You can start typing your load balancer's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
It displays load balancer's name, domain, its state and the VPC Id to which the load balancer is bound.
This command does not take any options, except for the default `--help`.

=== cloudhub load-balancer describe-json

[source,Example]
----
> cloudhub load-balancer describe [options] <name>
----
This command displays raw JSON response of the load balancer that is specified in <name>. +
You can start typing your load balancer's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== cloudhub load-balancer create

[source,Example]
----
> cloudhub load-balancer create [options] <vpc> <name> <certificate> <privateKey>
----
This command creates a load balancer using the specified values in the variables.
[%header,cols="12,53a,35a"]
|===
|Value |Description |Example
| vpc |Name of the VPC to which this load balancer is bound. +
*If your VPC name contains spaces, you need to pass it between ´"´ characters* | vpc-demo
| name |Name for the load balancer. | newtestloadbalancer
| Certificate |Absolute path to the `.pem` file of your certificate in your local hard drive. +
*Your certificate files need to be pem encoded and not encrypted* | /Users/mule/Documents/cert.pem
| privateKey |Absolute path to the `.asc` file of your private key in your local hard drive. +
*Your private key file needs to be passphraseless* | /Users/mule/Documents/privateKey.asc
|===

[CAUTION]
--
The name for the load balancer that you pass in <name> must be unique. +
By default your load balancer listens external requests on https and communicates with your workers internally through http. +
If you configured your Mule application within the VPC to listen on https, make sure you set `upstreamProtocol` to https when creating the mapping list using the link:/runtime-manager/anypoint-platform-cli#cloudhub-load-balancer-mappings-add[load-balancer mappings add] command.
--

Besides the default `--help` option, this command takes the following options:

[%header,cols="30a,70a"]
|===
|Value |Description
|http | Specifies the Load balancer HTTP behavior. It can be set to `on` (accepts http requests and forwards it to your configured default _sslendpoint_) `off` (refueses all http requests) or `redirect` (redirects to https).
|clientCertificate | Client certificate file
|verificationMode  | Specifies the client verification mode. It can be set to `on` (verify always) `off` (don't verify) or `optional` (Verification optional).
|crl | Certificate Revocation List file
|tlsv1  | Supports TLSv1 in addition to TLSv1.1 and TLSv1.2
|===

[NOTE]
Cloudhub does not implement the Online Certificate Status Protocol (OCSP), so in order to keep your certification revocation list up to date, it's recommended to use the link:https://anypoint.mulesoft.com/apiplatform/anypoint-platform/#/portals/organizations/68ef9520-24e9-4cf2-b2f5-620025690913/apis/8617/versions/85955/pages/107964[REST API] to programmatically update your certificates.

Further configuration information can be found in the link:/runtime-manager/cloudhub-dedicated-load-balancer#managing-certificates[certificates section] of the dedicated link:/runtime-manager/cloudhub-dedicated-load-balancer[load balancer documentation] page.

=== cloudhub load-balancer start

[source,Example]
----
> cloudhub load-balancer start [options] <name>
----
This command starts the load balancer specified in <name>. +
This command does not take any options, except for the default --help.


=== cloudhub load-balancer stop

[source,Example]
----
> cloudhub load-balancer stop [options] <name>
----
This command stops the load balancer specified in <name>. +
This command does not take any options, except for the default --help.

=== cloudhub load-balancer delete

[source,Example]
----
> cloudhub load-balancer delete [options] <name>
----
This command deletes the load balancer specified in <name>. +

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default --help.

=== cloudhub load-balancer ssl-endpoint add

[source,Example]
----
> cloudhub load-balancer ssl-endpoint add [options] <name> <certificate> <privateKey>
----
This command adds an SSL endpoint to the load balancer specified in <name>, using the certificate and private key passed.

[%header,cols="12a,53a,35a"]
|===
|Value |Description |Example
| name |Name for the load balancer. | newtestloadbalancer
| Certificate |Absolute path to the `.pem` file of your certificate in your local hard drive. +
*Your certificate files need to be pem encoded and not encrypted* | /Users/mule/Documents/cert.pem
| privateKey |Absolute path to the `.asc` file of your private key in your local hard drive. +
*Your private key file needs to be passphraseless* | /Users/mule/Documents/privateKey.asc
|===

[NOTE]
Cloudhub does not implement the Online Certificate Status Protocol (OCSP), so in order to keep your certification revocation list up to date, it's recommended to use the link:https://anypoint.mulesoft.com/apiplatform/sebastiankorol/#/portals/organizations/e853b9c5-6fb4-4590-8b25-0d29efeb8e98/apis/66762/versions/69421[REST API] to programmatically update your certificates.

Besides the default `--help` option, this command takes the following options:

[%header,cols="15a,85a"]
|===
|Value |Description
|http | Specifies the Load balancer HTTP behavior. It can be set to `on` (accepts http requests and forwards it to your configured default _sslendpoint_) `off` (refueses all http requests) or `redirect` (redirects to https).
|clientCertificate | Client certificate file
|verificationMode  | Specifies the client verification mode. It can be set to `on` (verify always) `off` (don't verify) or `optional` (Verification optional).
|crl | Certificate Revocation List file
|tlsv1  | Supports TLSv1 in addition to TLSv1.1 and TLSv1.2
|===

Further configuration information can be found in the link:/runtime-manager/cloudhub-dedicated-load-balancer#managing-certificates[certificates section] of the dedicated link:/runtime-manager/cloudhub-dedicated-load-balancer[load balancer documentation] page.

=== cloudhub load-balancer ssl-endpoint remove

[source,Example]
----
> cloudhub load-balancer ssl-endpoint remove [options] <name> <certificateName>
----
This command removes the ssl certificate specified in <certificateName> from the load balancer specified in <name>.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default --help.

=== cloudhub load-balancer ssl-endpoint set-default

[source,Example]
----
> cloudhub load-balancer ssl-endpoint set-default [options] <name> <certificateName>
----
This command sets the certificate specified in <certificateName> as the default  certificate for the load balancer passed in <name>. +

You can start typing your load balancer's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
Besides the default `--help` option, this command takes the following options:

[%header,cols="30a,70a"]
|===
|Value |Description
|http | Specifies the Load balancer HTTP behavior
|===

=== cloudhub load-balancer ssl-endpoint describe

[source,Example]
----
> cloudhub load-balancer ssl-endpoint describe [options] <name> <certificateName>
----
This command shows information about the configuration of the load balancer passed in <name> for the the certificate specified in <certificateName>. +
You can start typing your load balancer's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +

This command does not take any options, except for the default --help.

=== cloudhub load-balancer whitelist add

[source,Example]
----
> cloudhub load-balancer whitelist add [options] <name> <cidrBlock>
----
This command adds a range of IP addresses specified in <cidrBlock> to the whitelist of the load balancer specified in <name>.

[NOTE]
The whitelist works at the load balancer level, not at the CN certificate level. Make sure you only pass IP addresses formatted in link:https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing#IPv4_CIDR_blocks[CIDR notation].

You can start typing your load balancer's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default --help.

=== cloudhub load-balancer whitelist remove

[source,Example]
----
> cloudhub load-balancer whitelist remove <name> <cidrBlock>
----
This command removes an IP, or range of IPs addresses specified in <cidrBlock> to the whitelist of the load balancer specified in <name>.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default --help.

=== cloudhub load-balancer mappings describe

[source,Example]
----
> cloudhub load-balancer mappings describe <name> [certificateName]
----
This command lists the mapping rules for the load balancer specified in <name>. +
If no `certificateName` is passed, Anypoint CLI returns the mappings for the default SSL endpoint.

This command does not take any options, except for the default --help.

=== cloudhub load-balancer mappings add

[source,Example]
----
> cloudhub load-balancer mappings add <name> <index> <inputUri> <appName> <appUri> [certificateName] [upstreamProtocol]
----
This command adds a proxy mapping rule to the load balancer specified in <name> at the priority index specified in <index> in the CN passed under the `certificateName` option, using the protocol set in `upstreamProtocol` and the values set in the variables +

[%header,cols="12a,68a,20a"]
|===
|Value |Description |Example
|name|Name of the load balancer to which this rule is applied. |testloadbalancer
|index|Priority of the rule.  |1
|inputUri|Name of the URI of your input URL |example.com
|appName|Name of the app of your output URL to which the request is forwarded |{app}-example
|appUri|URI of the app of your output URL to which the request is forwarded |/
|===

For the values in the example above, for an input call to `my-superapp.api.example.com/status?limit=10`, the endpoint `my-superapp-example: /status?limit=10` will be called for the application.

If no `certificateName` is passed, Anypoint CLI adds the mappings to the default SSL endpoint.

The `--upstreamProtocol` option sets the protocol used by your application to communicate internally with your load balancer. +
The allowed values are `http` or `https`. If no upstreamProtocol is set, HTTP is used as default.


=== cloudhub load-balancer mappings remove

[source,Example]
----
> cloudhub load-balancer mappings remove [options] <name> <index> [certificateName]
----
This command removes the proxy mapping rules from the load balancer specified in <name> at the priority index specified in <index> and the CN specified as the `certificateName` option.

This command does not take any options, except for the default --help.
If no `certificateName` is passed, Anypoint CLI removes the mappings for the default SSL endpoint.

=== cloudhub region list

[source,Example]
----
> cloudhub region list [options]
----
This command lists all supported regions. +
This command does not take any options, except for the default `--help`.

=== cloudhub runtime list
[source,Example]
----
> cloudhub runtime list [options]
----
This command lists all supported runtimes. +
This command does not take any options, except for the default `--help`.

=== cloudhub vpc list

[source,Example]
----
> cloudhub vpc list [options]
----
This command lists all available VPCs. It returns ID, region, and environment of the network and wether it is the default VPC or not.

=== cloudhub vpc describe

[source,Example]
----
> cloudhub vpc describe [options] <name>
----
This command displays information about the VPC that is specified in <name>. +
You can start typing your VPC's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== cloudhub vpc describe-json

[source,Example]
----
> cloudhub vpc describe [options] <name>
----
This command displays raw JSON response of the VPC that is specified in <name>. +
You can start typing your VPC's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.

=== cloudhub vpc create

[source,Example]
----
> cloudhub vpc create [options] <name> <region> <cidrBlock> [environments...]
----
This command creates a VPC using the name in <name>, in the region specified in <region>, with the link:/runtime-manager/virtual-private-cloud#size-your-vpc[size] passed in <cidrBlock> in the form of a Classless Inter-Domain Routing (CIDR) block, using link:https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing#IPv4_CIDR_blocks[CIDR notation] and associates it to the link:/access-management/environments[environment] passed in `--environments`.

[NOTE]
A VPC needs to be bound to a business group within your organization. When creating a VPC, make sure to assign it a business group using the <<cloudhub vpc business-groups add, business-groups add>> command.

Besides the default `--help` option, this command also takes the `--default` option. When passed, the VPC is created as the default VPC for the selected environment.

=== cloudhub vpc delete

[source,Example]
----
> cloudhub vpc delete <name>
----
This command deletes the VPC specified in <name>.

[WARNING]
This command does not prompt twice before deleting. If you send a delete instruction, it does not ask for confirmation.

This command does not take any options, except for the default `--help`.

=== cloudhub vpc environments add

[source,Example]
----
> cloudhub vpc environments add [options] <vpc> [environments...]
----
This command assigns the VPC defined in <vpc> to the environment names passed as arguments. +
The `--default` option allows to set a VPC as the default for the organization, which applies to all environments which don't have a VPC explicitly associated.

This command also takes the default `--help` option.

=== cloudhub vpc environments remove

[source,Example]
----
> cloudhub vpc environments remove [options] <vpc> [environments...]
----
This command removes the VPC defined in <vpc> from the environment passed in the `--environments` option. +
Besides the default `--help` option, this command also takes the option `--default`, that removes this VPC as the default VPC for the environment.

=== cloudhub vpc business-groups add

[source,Example]
----
> cloudhub vpc business-groups add [options] <vpc> <businessGroups...>
----
This command assigns the VPC defined in <vpc> to the business group passed in <businessGroups> +
This command does not take any options, except for the default `--help`.

=== cloudhub vpc business-groups remove
[source,Example]
----
> cloudhub vpc business-groups remove [options] <vpc> <businessGroups...>
----
This command removes the VPC defined in <vpc> from the business group passed in <businessGroups> +

[WARNING]
This command does not prompt twice before removing the VPC from the specified resource. If you send a remove instruction, it does not ask for confirmation.

This command does not take any options, except for the default `--help`.

=== cloudhub vpc dns-servers set

[source,Example]
----
> cloudhub vpc dns-servers set [options] <vpc>
----
This command sets a list of local host names (internal domain names) to be resolved using your DNS servers for which you need to provide their IP addresses (whether private or public addresses). +
Whenever those private domains are provided, your worker resolves them using your private DNS, so you can still use the internal host names of your private network.

[NOTE]
This feature is supported by workers running Mule versions 3.5.x, 3.6.x, 3.7.4, 3.8.0-HF1, 3.8.1 and 3.8.2.


Besides the default `--help` option, this command takes the following options:

[%header,cols="20a,80a"]
|===
|Option |Description
| server | IP for a DNS server to resolve special domains on. Can be specified up to 3 times
| domain | A domain to resolve on the special DNS server list. Can be specified multiple times
|===

You can pass as many domains as you need, and up to 3 IP addresses. +
For example, `$ cloudhub vpc dns-servers set --domain example.com --server 192.168.1.10 <VPC Name>`.

Every time you run this command, you overwrite your previous DNS set command. +
In order to remove a DNS set, you need to use the <<cloudhub vpc dns-servers unset,vpc dns-servers unset>> command.

=== cloudhub vpc dns-servers unset

[source,Example]
----
> cloudhub vpc dns-servers unset [options] <vpc>
----
This command clears the list of local host names (internal domain names) to be resolved using your DNS servers from the VPC passed in <vpc>

This command does not take any options, except for the default `--help`.

=== cloudhub vpc firewall-rules describe

[source,Example]
----
> cloudhub vpc firewall-rules describe <vpc>
----
This command describes all the firewall rules for the VPC defined in <vpc>. +
This command does not take any options, except for the default `--help`.


=== cloudhub vpc firewall-rules add

[source,Example]
----
> cloudhub vpc firewall-rules add [options] <vpc> <cidrBlock> <protocol> <fromPort> [toPort]
----
This command adds a firewall rule to the VPC defined in <vpc> using the values set in the variables: +

[%header,cols="18a,62a,20a"]
|===
|Value |Description |Example
| vpc |Name of the VPC to which this load balancer is bound. +
*If your VPC name contains spaces, you need to pass it between ´"´ characters* | vpc-demo
| cidrBlock | IP address in CIDR notation for the firewall to allow  | 192.0.1.0/27
| protocol | The protocol to use in the rules. It can be `tcp` or `udp` | tcp
| fromPort | The port from which the firewall will allows requests. it can go from 0 to 65535 | 8888
| toPort | *optional* In case a port range is needed, the `fromPort` and `toPort` variables define such range | 8090
|===

[CAUTION]
--
When creating a VPC, make sure to allow your outbound address. +
By default, all IP addresses are blocked and you need to authorize IP addresses, or range of addresses to your VPC firewall rule.
--

You can start typing your VPC's name and hit `tab` for Anypoint-CLI to autocomplete it, or you can double tap `tab` for a full list of all the values you can pass. +
This command does not take any options, except for the default `--help`.


=== cloudhub vpc firewall-rules remove

[source,Example]
----
> cloudhub vpc firewall-rules remove <vpc> <index>
----
This command removes the firewall rule from the workers inside the VPC specified in <vpc> at the index passed in the <index>. +
This command does not take any options, except for the default `--help`.

=== use environment
[source,Example]
----
> use environment [options] <name>
----
This command makes active the environment specified in <name>. +
This command does not take any options, except for the default `--help`.

=== use business-group

[source,Example]
----
> use business-group  [options] <name>
----
This command makes the business group you specified in <name> active.

[NOTE]
--
If your business group or organization name contains spaces, you need to enclose its name between `"` characters.

----
> use business-group "QA Organization"
----
--

=== exit

[source,Example]
----
> exit [options]
----
This command exits Anypoint-CLI. +
This command does not take any options, except for the default `--help`
